<?php
declare(strict_types=1);
// 泰语
return [
    // 安装器相关
    'install' => [
        'index' => [
            'key001' => 'WarriorPHP ตัวช่วยติดตั้ง',
            'key002' => 'ระบบได้รับการติดตั้งแล้ว หากต้องการติดตั้งใหม่ โปรดลบไฟล์ resources/install.lock',
            'key003' => 'ตัวช่วยติดตั้ง',
            'key004' => 'การตั้งค่าฐานข้อมูล',
            'key005' => 'ยินดีต้อนรับสู่ระบบจัดการเนื้อหา! กรุณาเตรียมข้อมูลฐานข้อมูลให้พร้อม (ที่อยู่ฐานข้อมูล ชื่อผู้ใช้ รหัสผ่าน ชื่อฐานข้อมูล) ระบบจะตรวจสอบการตั้งค่าสภาพแวดล้อมโดยอัตโนมัติ และนำทางคุณเพื่อเริ่มต้นฐานข้อมูลและสร้างบัญชีผู้ดูแลระบบ หลังจากติดตั้งเสร็จ กรุณาลบหรือเปลี่ยนชื่อโฟลเดอร์ install เพื่อความปลอดภัย หากพบปัญหาระหว่างการติดตั้ง กรุณาดูคู่มือการติดตั้งหรือ ติดต่อทีมซัพพอร์ตของเรา ขอให้ใช้งานอย่างมีความสุข!',
            'key006' => 'ที่อยู่ฐานข้อมูล',
            'key007' => 'กรุณาใส่ที่อยู่ Host ของฐานข้อมูล',
            'key008' => 'พอร์ตฐานข้อมูล',
            'key009' => 'กรุณาใส่พอร์ตฐานข้อมูล',
            'key010' => 'ชื่อผู้ใช้ฐานข้อมูล',
            'key011' => 'กรุณาใส่ชื่อผู้ใช้ฐานข้อมูล',
            'key012' => 'รหัสผ่านฐานข้อมูล',
            'key013' => 'กรุณาใส่รหัสผ่านฐานข้อมูล',
            'key014' => 'เขียนทับฐานข้อมูล',
            'key015' => 'เขียนทับ',
            'key016' => 'ไม่เขียนทับ',
            'key017' => 'ถัดไป',
        ],
    ],
    // 首页相关
    'home'    => [
        'index' => [
            'key001' => 'แถบนำทาง'
        ]
    ],
    // 管理相关
    'admin'   => [
        'account' => [
            'login' => [
                'key001' => 'เข้าสู่ระบบผู้ใช้',
                'key002' => 'อีเมล',
                'key003' => 'กรุณากรอกอีเมลของคุณ',
                'key004' => 'รหัสผ่าน',
                'key005' => 'กรอกรหัสผ่านของคุณ',
                'key006' => 'จดจำบัญชีผู้ใช้',
                'key007' => 'เข้าสู่ระบบ',
                'key008' => 'รหัสยืนยันภาพ',
                'key009' => 'กรุณากรอกรหัสยืนยันภาพ',
                'key010' => 'พยายามเข้าสู่ระบบมากเกินไป กรุณาลองใหม่ภายหลัง',
                'key011' => 'รหัสยืนยันภาพไม่ถูกต้อง',
                'key012' => 'เข้าสู่ระบบล้มเหลว',
                'key013' => 'อีเมลหรือรหัสผ่านไม่ถูกต้อง',
                'key014' => 'เข้าสู่ระบบสำเร็จ',
            ],
        ],
        // 验证相关
        'request' => [
            'key001' => 'กรุณาใส่อีเมลให้ถูกต้อง',
            'key002' => 'รหัสผ่านต้องเป็นข้อความ',
            'key003' => 'รหัสผ่านต้องมีความยาวระหว่าง 6 ถึง 32 ตัวอักษร',
            'key004' => 'รหัสยืนยันต้องเป็นข้อความ',
            'key005' => 'รหัสยืนยันต้องมีความยาว 5 หลัก',
        ]
    ],
];