<?php
declare(strict_types=1);
// 泰语
return [
    // 安装器相关
    'install' => [
        'index' => [
            'pageTitle'             => 'WarriorPHP ตัวช่วยติดตั้ง',
            'installedWarning'      => 'ระบบได้รับการติดตั้งแล้ว หากต้องการติดตั้งใหม่ โปรดลบไฟล์ resources/install.lock',
            'installationWizard'    => 'ตัวช่วยติดตั้ง',
            'databaseConfiguration' => 'การตั้งค่าฐานข้อมูล',
            'installationTips'      => 'ยินดีต้อนรับสู่ระบบจัดการเนื้อหา! กรุณาเตรียมข้อมูลฐานข้อมูลให้พร้อม (ที่อยู่ฐานข้อมูล ชื่อผู้ใช้ รหัสผ่าน ชื่อฐานข้อมูล) ระบบจะตรวจสอบการตั้งค่าสภาพแวดล้อมโดยอัตโนมัติ และนำทางคุณเพื่อเริ่มต้นฐานข้อมูลและสร้างบัญชีผู้ดูแลระบบ หลังจากติดตั้งเสร็จ กรุณาลบหรือเปลี่ยนชื่อโฟลเดอร์ install เพื่อความปลอดภัย หากพบปัญหาระหว่างการติดตั้ง กรุณาดูคู่มือการติดตั้งหรือ ติดต่อทีมซัพพอร์ตของเรา ขอให้ใช้งานอย่างมีความสุข!',
            'databaseAddress'       => 'ที่อยู่ฐานข้อมูล',
            'enterDatabaseHost'     => 'กรุณาใส่ที่อยู่ Host ของฐานข้อมูล',
            'databasePort'          => 'พอร์ตฐานข้อมูล',
            'enterDatabasePort'     => 'กรุณาใส่พอร์ตฐานข้อมูล',
            'databaseUsername'      => 'ชื่อผู้ใช้ฐานข้อมูล',
            'enterDatabaseUsername' => 'กรุณาใส่ชื่อผู้ใช้ฐานข้อมูล',
            'databasePassword'      => 'รหัสผ่านฐานข้อมูล',
            'enterDatabasePassword' => 'กรุณาใส่รหัสผ่านฐานข้อมูล',
            'overwriteDatabase'     => 'เขียนทับฐานข้อมูล',
            'cover'                 => 'เขียนทับ',
            'notCovered'            => 'ไม่เขียนทับ',
            'nextStep'              => 'ถัดไป',
        ],
    ],
    // 首页相关
    'home'    => [
        'index' => [
            'navigation' => 'แถบนำทาง'
        ]
    ],
    // 管理相关
    'manage'  => [
        'index'   => [
            'login' => [
                'pageTitle'         => 'เข้าสู่ระบบผู้ดูแล',
                'emailAddress'      => 'อีเมล',
                'enterEmail'        => 'กรุณาใส่อีเมลของคุณ',
                'password'          => 'รหัสผ่าน',
                'enterYourPassword' => 'กรุณาใส่รหัสผ่านของคุณ',
                'rememberMe'        => 'จดจำฉันไว้',
                'logIn'             => 'เข้าสู่ระบบ',
                'captcha'           => 'รหัสยืนยัน',
                'enterCaptcha'      => 'กรุณาใส่รหัสยืนยัน',
            ],
        ],
        // 验证相关
        'request' => [
            'email'          => 'กรุณากรอกอีเมลที่ถูกต้อง',
            'passwordString' => 'รหัสผ่านต้องเป็นตัวอักษร',
            'passwordLength' => 'รหัสผ่านต้องมีความยาว 6 ถึง 32 ตัวอักษร',
            'captchaLength'  => 'รหัสยืนยันต้องมีความยาว 5 หลัก',
        ]
    ],
];