<?php
declare(strict_types=1);
// 中文繁體（香港）
return [
    // 安装器相关
    'install' => [
        'index' => [
            'key001' => 'WarriorPHP 安裝精靈',
            'key002' => '系統已安裝。若要重新安裝，請刪除 resources/install.lock 檔案。',
            'key003' => '安裝精靈',
            'key004' => '資料庫設定',
            'key005' => '歡迎使用本內容管理系統！請預先準備好資料庫資料（資料庫位址、用戶名稱、密碼、資料庫名稱），系統會自動檢查您的環境設定，並引導您完成資料庫初始化及管理員帳戶建立。安裝完成後，請務必刪除或重新命名安裝目錄（install），以確保系統安全。如在安裝過程中遇到任何問題，請參考安裝文件或聯絡我們的技術支援。祝您使用愉快！',
            'key006' => '資料庫位址',
            'key007' => '請輸入資料庫主機位址',
            'key008' => '資料庫埠口',
            'key009' => '請輸入資料庫埠口',
            'key010' => '資料庫用戶名稱',
            'key011' => '請輸入資料庫用戶名稱',
            'key012' => '資料庫密碼',
            'key013' => '請輸入資料庫密碼',
            'key014' => '覆蓋資料庫',
            'key015' => '覆蓋',
            'key016' => '不覆蓋',
            'key017' => '下一步',
        ],
    ],
    // 管理相关
    'admin'   => [
        'account' => [
            'login' => [
                'key001' => '用戶登入',
                'key002' => '電子郵件地址',
                'key003' => '請輸入電子郵件地址',
                'key004' => '密碼',
                'key005' => '請輸入密碼',
                'key006' => '記住帳號',
                'key007' => '登入',
                'key008' => '圖形驗證碼',
                'key009' => '請輸入圖形驗證碼',
                'key010' => '登入錯誤次數過多，請稍後再試',
                'key011' => '驗證碼錯誤',
                'key012' => '登入失敗',
                'key013' => '帳號或密碼錯誤',
                'key014' => '登入成功',
            ],
        ],
        // 验证相关
        'request' => [
            'key001' => '請輸入有效的電子郵件地址',
            'key002' => '密碼必須是字串',
            'key003' => '密碼長度必須在6到32個字元之間',
            'key004' => '驗證碼必須是字串',
            'key005' => '驗證碼長度必須為5位',
        ]
    ],
];